In [9]:
import pandas as pd;

studentsData = [
    {"Roll No": 1, "Name": "Alice", "Father Name": "Bob", "Course": "Physics", "Date Of Admission": "2023-01-10", "Fee": 10000},
    {"Roll No": 2, "Name": "Brian", "Father Name": "Steve", "Course": "Chemistry", "Date Of Admission": "2023-02-12", "Fee": 11000},
    {"Roll No": 3, "Name": "Chloe", "Father Name": "Tim", "Course": "Biology", "Date Of Admission": "2023-03-14", "Fee": 12000},
    {"Roll No": 4, "Name": "David", "Father Name": "Rick", "Course": "Mathematics", "Date Of Admission": "2023-04-10", "Fee": 13000},
    {"Roll No": 5, "Name": "Eva", "Father Name": "John", "Course": "Computer Science", "Date Of Admission": "2023-11-16", "Fee": 14000},
    {"Roll No": 6, "Name": "Frank", "Father Name": "Tom", "Course": "Economics", "Date Of Admission": "2023-06-21", "Fee": 15000},
    {"Roll No": 7, "Name": "Grace", "Father Name": "Harry", "Course": "History", "Date Of Admission": "2023-07-25", "Fee": 16000},
    {"Roll No": 8, "Name": "Henry", "Father Name": "Charles", "Course": "Geography", "Date Of Admission": "2023-08-17", "Fee": 17000},
    {"Roll No": 9, "Name": "Isabel", "Father Name": "Oliver", "Course": "English", "Date Of Admission": "2023-09-10", "Fee": 18000},
    {"Roll No": 10, "Name": "Jack", "Father Name": "Noah", "Course": "Art", "Date Of Admission": "2023-10-05", "Fee": 19000}
];

studentsDf : pd.DataFrame = pd.DataFrame(studentsData);

studentsDf["Date Of Admission"] = pd.to_datetime(studentsDf["Date Of Admission"]);

display(studentsDf);

   Roll No    Name Father Name            Course Date Of Admission    Fee
0        1   Alice         Bob           Physics        2023-01-10  10000
1        2   Brian       Steve         Chemistry        2023-02-12  11000
2        3   Chloe         Tim           Biology        2023-03-14  12000
3        4   David        Rick       Mathematics        2023-04-10  13000
4        5     Eva        John  Computer Science        2023-11-16  14000
5        6   Frank         Tom         Economics        2023-06-21  15000
6        7   Grace       Harry           History        2023-07-25  16000
7        8   Henry     Charles         Geography        2023-08-17  17000
8        9  Isabel      Oliver           English        2023-09-10  18000
9       10    Jack        Noah               Art        2023-10-05  19000

In [10]:
studentsDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Roll No            10 non-null     int64
 1   Name               10 non-null     object
 2   Father Name        10 non-null     object
 3   Course             10 non-null     object
 4   Date Of Admission  10 non-null     datetime64[ns]
 5   Fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

In [11]:
import pandera as pa;
import pandas as pd;
from pandera.typing import Series;
from datetime import datetime;

class StudentSchema(pa.SchemaModel):
    Roll_No: Series[int] = pa.Field(ge=1);
    Name: Series[str] = pa.Field(nullable=False);
    Father_Name: Series[str] = pa.Field(nullable=False);
    Course: Series[str] = pa.Field(nullable=False);
    Date_Of_Admission: Series[datetime] = pa.Field(le=datetime.now());
    Fee: Series[int] = pa.Field(ge=0);

studentsData = [
    {"Roll_No": 1, "Name": "Alice", "Father_Name": "Bob", "Course": "Physics", "Date_Of_Admission": "2023-01-10", "Fee": 10000},
    {"Roll_No": 2, "Name": "Brian", "Father_Name": "Steve", "Course": "Chemistry", "Date_Of_Admission": "2023-02-12", "Fee": 11000},
    {"Roll_No": 3, "Name": "Chloe", "Father_Name": "Tim", "Course": "Biology", "Date_Of_Admission": "2023-03-14", "Fee": 12000},
    {"Roll_No": 4, "Name": "David", "Father_Name": "Rick", "Course": "Mathematics", "Date_Of_Admission": "2023-04-10", "Fee": 13000},
    {"Roll_No": 5, "Name": "Eva", "Father_Name": "John", "Course": "Computer Science", "Date_Of_Admission": "2023-11-16", "Fee": 14000},
    {"Roll_No": 6, "Name": "Frank", "Father_Name": "Tom", "Course": "Economics", "Date_Of_Admission": "2023-06-21", "Fee": 15000},
    {"Roll_No": 7, "Name": "Grace", "Father_Name": "Harry", "Course": "History", "Date_Of_Admission": "2023-07-25", "Fee": 16000},
    {"Roll_No": 8, "Name": "Henry", "Father_Name": "Charles", "Course": "Geography", "Date_Of_Admission": "2023-08-17", "Fee": 17000},
    {"Roll_No": 9, "Name": "Isabel", "Father_Name": "Oliver", "Course": "English", "Date_Of_Admission": "2023-09-10", "Fee": 18000},
    {"Roll_No": 10, "Name": "Jack", "Father_Name": "Noah", "Course": "Art", "Date_Of_Admission": "2023-10-05", "Fee": 19000}
];

studentsDf : pd.DataFrame = pd.DataFrame(studentsData);

studentsDf["Date_Of_Admission"] = pd.to_datetime(studentsDf["Date_Of_Admission"]);

validatedDf = StudentSchema.validate(studentsDf);

validatedDf

   Roll_No    Name Father_Name            Course Date_Of_Admission    Fee
0        1   Alice         Bob           Physics        2023-01-10  10000
1        2   Brian       Steve         Chemistry        2023-02-12  11000
2        3   Chloe         Tim           Biology        2023-03-14  12000
3        4   David        Rick       Mathematics        2023-04-10  13000
4        5     Eva        John  Computer Science        2023-11-16  14000
5        6   Frank         Tom         Economics        2023-06-21  15000
6        7   Grace       Harry           History        2023-07-25  16000
7        8   Henry     Charles         Geography        2023-08-17  17000
8        9  Isabel      Oliver           English        2023-09-10  18000
9       10    Jack        Noah               Art        2023-10-05  19000

# **Filter Functions On Dataframe**

In [12]:
studentsDf.head()

   Roll_No   Name Father_Name            Course Date_Of_Admission    Fee
0        1  Alice         Bob           Physics        2023-01-10  10000
1        2  Brian       Steve         Chemistry        2023-02-12  11000
2        3  Chloe         Tim           Biology        2023-03-14  12000
3        4  David        Rick       Mathematics        2023-04-10  13000
4        5    Eva        John  Computer Science        2023-11-16  14000

In [13]:
studentsDf.head(2)

   Roll_No   Name Father_Name     Course Date_Of_Admission    Fee
0        1  Alice         Bob    Physics        2023-01-10  10000
1        2  Brian       Steve  Chemistry        2023-02-12  11000

In [14]:
studentsDf.Course.value_counts()

Course
Physics             1
Chemistry           1
Biology             1
Mathematics         1
Computer Science    1
Economics           1
History             1
Geography           1
English             1
Art                 1
Name: count, dtype: int64

In [20]:
import pandas as pd;

studentsData = [
    {"Roll No": 1, "Name": "Alice", "Father Name": "Bob", "Course": "Physics", "Date Of Admission": "2023-01-10", "Fee": 10000},
    {"Roll No": 2, "Name": "Brian", "Father Name": "Steve", "Course": "Chemistry", "Date Of Admission": "2023-02-12", "Fee": 11000},
    {"Roll No": 3, "Name": "Chloe", "Father Name": "Tim", "Course": "Computer Science", "Date Of Admission": "2023-03-14", "Fee": 12000},
    {"Roll No": 4, "Name": "David", "Father Name": "Rick", "Course": "Mathematics", "Date Of Admission": "2023-04-10", "Fee": 13000},
    {"Roll No": 5, "Name": "Eva", "Father Name": "John", "Course": "Computer Science", "Date Of Admission": "2023-11-16", "Fee": 14000},
    {"Roll No": 6, "Name": "Frank", "Father Name": "Tom", "Course": "Computer Science", "Date Of Admission": "2023-06-21", "Fee": 15000},
    {"Roll No": 7, "Name": "Grace", "Father Name": "Harry", "Course": "History", "Date Of Admission": "2023-07-25", "Fee": 16000},
    {"Roll No": 8, "Name": "Henry", "Father Name": "Charles", "Course": "Geography", "Date Of Admission": "2023-08-17", "Fee": 17000},
    {"Roll No": 9, "Name": "Isabel", "Father Name": "Oliver", "Course": "English", "Date Of Admission": "2023-09-10", "Fee": 18000},
    {"Roll No": 10, "Name": "Jack", "Father Name": "Noah", "Course": "Mathematics", "Date Of Admission": "2023-10-05", "Fee": 19000}
];

studentsDf : pd.DataFrame = pd.DataFrame(studentsData);

studentsDf["Date Of Admission"] = pd.to_datetime(studentsDf["Date Of Admission"]);

studentsDf.Course.value_counts()

Course
Computer Science    3
Mathematics         2
Physics             1
Chemistry           1
History             1
Geography           1
English             1
Name: count, dtype: int64

In [23]:
studentsDf.Course.value_counts(dropna=False) # Also Counts Null Cell Value

Course
Computer Science    3
Mathematics         2
Physics             1
Chemistry           1
History             1
Geography           1
English             1
Name: count, dtype: int64

In [26]:
studentsDf.Course.value_counts(dropna=False, normalize=True) # Return In Percentage Of Count Value

Course
Computer Science    0.3
Mathematics         0.2
Physics             0.1
Chemistry           0.1
History             0.1
Geography           0.1
English             0.1
Name: proportion, dtype: float64

In [27]:
studentsDf.Course.value_counts(dropna=False, normalize=True) * 100

Course
Computer Science    30.0
Mathematics         20.0
Physics             10.0
Chemistry           10.0
History             10.0
Geography           10.0
English             10.0
Name: proportion, dtype: float64

In [28]:
studentsDf

   Roll No    Name Father Name            Course Date Of Admission    Fee
0        1   Alice         Bob           Physics        2023-01-10  10000
1        2   Brian       Steve         Chemistry        2023-02-12  11000
2        3   Chloe         Tim  Computer Science        2023-03-14  12000
3        4   David        Rick       Mathematics        2023-04-10  13000
4        5     Eva        John  Computer Science        2023-11-16  14000
5        6   Frank         Tom  Computer Science        2023-06-21  15000
6        7   Grace       Harry           History        2023-07-25  16000
7        8   Henry     Charles         Geography        2023-08-17  17000
8        9  Isabel      Oliver           English        2023-09-10  18000
9       10    Jack        Noah       Mathematics        2023-10-05  19000